1C-Medtech/1СМедтехника.днк/src/Documents/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДополнительныеРасходы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предоплата</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1C-Medtech/1СМедтехника.днк/src/Documents/ДополнительныеРасходы/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура днк_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	//Добавим в форму новые реквизиты
	новыеРеквизиты = Новый Массив;
	
	новыйРеквизит = Новый РеквизитФормы("днкКоэффициент",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,12,ДопустимыйЗнак.Неотрицательный)), "Объект.Запасы", "% от Суммы услуг", Ложь);
	новыеРеквизиты.Добавить(новыйРеквизит);
	
	ИзменитьРеквизиты(новыеРеквизиты);
	
	//Добавим в форму новые элементы и свяжем их с новыми реквизитами
	новыйЭлемент = Элементы.Добавить("ЗапасыДнкКоэффициент", Тип("ПолеФормы"), Элементы.Запасы);
	новыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	новыйЭлемент.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
	новыйЭлемент.ОтображатьВПодвале = Истина;
	новыйЭлемент.ПутьКДаннымПодвала = "ИтогДнкКоэффициент";
	новыйЭлемент.ПутьКДанным = "Объект.Запасы.днкКоэффициент";
	//Поставим в нужное место
	Элементы.Переместить(новыйЭлемент, Элементы.Запасы, Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСуммаРасходов);
	
	//Добавим обработчики событий
	новыйЭлемент.УстановитьДействие("ПриИзменении","днк_ЗапасыДнкКоэффициентПриИзменении");

КонецПроцедуры

&НаСервере
Процедура днк_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Заполним проценты
	днк_ПересчитатьДнкКоэффициентСервер();
КонецПроцедуры

&НаСервере
// Процедура заполняет табличную часть "Расходы" -
// Параметры:
// 		МассивДокументов - массив документов, по которым происходит заполнение
//							в зависимости от способа заполнения:
//							по всем документам, по одному, по отмеченным
Процедура днк_ЗаполнитьСписокНоменклатуры(МассивДокументов)
	
	Запрос			= Новый Запрос;
	
	Запрос.Текст	= 
	"ВЫБРАТЬ
	|	ИСТИНА КАК Отметка,
	|	ЗаказПоставщикуЗапасы.Ссылка КАК Документ,
	|	ЗаказПоставщикуЗапасы.Номенклатура,
	|	ЗаказПоставщикуЗапасы.Характеристика,
	|	ЗаказПоставщикуЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказПоставщикуЗапасы.Количество,
	|	ЗаказПоставщикуЗапасы.Цена,
	|	ЗаказПоставщикуЗапасы.Сумма,
	|	ЗаказПоставщикуЗапасы.СтавкаНДС,
	|	ЗаказПоставщикуЗапасы.СуммаНДС,
	|	ЗаказПоставщикуЗапасы.Всего,
	|	1 КАК Коэффициент,
	|	ЗаказПоставщикуЗапасы.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаказПоставщикуЗапасы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	|ГДЕ
	|	ЗаказПоставщикуЗапасы.Ссылка В(&МассивДокументов)
	|	И &УсловиеОтбораНоменклатурыДляЗаказаПоставщику"; 
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	//Если ЗаполнятьТолькоПоУказаннойНоменклатуре Тогда
	//	
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораНоменклатурыДляЗаказаПоставщику",	"ЗаказПоставщикуЗапасы.Номенклатура В(&МассивНоменклатуры)");
	//	Запрос.УстановитьПараметр("МассивНоменклатуры", ОтобраннаяНоменклатура.Выгрузить());
	//	
	//Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораНоменклатурыДляЗаказаПоставщику",	"ЗаказПоставщикуЗапасы.Номенклатура.ТипНоменклатуры В (&МассивТипыНоменклатуры)");
		МассивТипыНоменклатуры = Новый Массив();
		МассивТипыНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
		Запрос.УстановитьПараметр("МассивТипыНоменклатуры", МассивТипыНоменклатуры);
		
	//КонецЕсли;
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		//Если ДобавлятьНовыеПозицииВПодвалТаблицы Тогда 
		//	
		//	ЗаполнитьЗначенияСвойств(Расходы.Добавить(), ВыборкаЗапроса);
		//	
		//Иначе
		//	
		//	Цена = ВыборкаЗапроса.Цена;
		//	Если ВыборкаЗапроса.СуммаВключаетНДС <> СуммаВключаетНДС Тогда
		//		
		//		Цена = Окр(УправлениеНебольшойФирмойСервер.ПересчитатьСуммуПриИзмененииФлаговНДС(Цена, СуммаВключаетНДС, ВыборкаЗапроса.СтавкаНДС), 2);
		//		
		//	КонецЕсли;
		//	
		//	СтруктураПоиска = Новый Структура("ДокументПоступления, Номенклатура, Характеристика, Партия, ЕдиницаИзмерения, СтавкаНДС, Цена",
		//		ВыборкаЗапроса.ДокументПоступления,
		//		ВыборкаЗапроса.Номенклатура,
		//		ВыборкаЗапроса.Характеристика,
		//		ВыборкаЗапроса.Партия,
		//		ВыборкаЗапроса.ЕдиницаИзмерения,
		//		ВыборкаЗапроса.СтавкаНДС,
		//		Цена); //Цена должна совпадать, иначе две строки и пусть определяют нужную цену для долей распределения
		//		
		//	СтрокаДубликата	= Расходы.НайтиСтроки(СтруктураПоиска);
		//	
		//	//Пользователь руками может создать дубл. строку
		//	//мешать не будим, ведь это не ведет к ошибочным действиям
		//	//просто добавим данные в первую найденную строку
		//	Если СтрокаДубликата.Количество() > 0 Тогда 
		//		
		//		//Подсчет на сервере, не уходя на клиента
		//		СтрокаДубликата[0].Количество = СтрокаДубликата[0].Количество + ВыборкаЗапроса.Количество;
		//		
		//		Если ВыборкаЗапроса.СуммаВключаетНДС = СуммаВключаетНДС Тогда
		//			
		//			СтрокаДубликата[0].Сумма = СтрокаДубликата[0].Количество * СтрокаДубликата[0].Цена;
		//			
		//		ИначеЕсли ВыборкаЗапроса.СуммаВключаетНДС И НЕ СуммаВключаетНДС Тогда
		//			
		//			СтрокаДубликата[0].Сумма = СтрокаДубликата[0].Сумма + Окр((ВыборкаЗапроса.Сумма / ((ВыборкаЗапроса.СтавкаНДС.Ставка + 100) / 100)), 2);
		//			
		//		ИначеЕсли ВыборкаЗапроса.СуммаВключаетНДС И НЕ СуммаВключаетНДС Тогда
		//			
		//			СтрокаДубликата[0].Сумма = СтрокаДубликата[0].Сумма + Окр((ВыборкаЗапроса.Сумма - ВыборкаЗапроса.Сумма / ((ВыборкаЗапроса.СтавкаНДС.Ставка + 100) / 100)), 2);
		//			
		//		КонецЕсли;
		//		
		//		СтрокаДубликата[0].СуммаНДС = СтрокаДубликата[0].СуммаНДС + ВыборкаЗапроса.СуммаНДС;
		//		СтрокаДубликата[0].Всего = СтрокаДубликата[0].Всего + ВыборкаЗапроса.Всего;
		//		
		//	Иначе
				
				// Новая строка
				НоваяСтрока = Объект["Расходы"].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапроса, "Номенклатура, ЕдиницаИзмерения, Количество, Цена, Сумма, СтавкаНДС, СуммаНДС, Всего");
				
				//НоваяСтрока.Отметка = Истина;
				//////Если ВыборкаЗапроса.СуммаВключаетНДС = СуммаВключаетНДС Тогда
				//////	
				//////	НоваяСтрока.Цена		= Цена;
				//////	НоваяСтрока.Сумма		= ВыборкаЗапроса.Сумма;
				//////	НоваяСтрока.СуммаНДС	= ВыборкаЗапроса.СуммаНДС;
				//////	НоваяСтрока.Всего		= ВыборкаЗапроса.Всего;
				//////	
				//////ИначеЕсли ВыборкаЗапроса.СуммаВключаетНДС И НЕ СуммаВключаетНДС Тогда
				//////	
				//////	НоваяСтрока.Цена		= Цена;
				//////	НоваяСтрока.Сумма		= Окр(ВыборкаЗапроса.Сумма / ((ВыборкаЗапроса.СтавкаНДС.Ставка + 100) / 100), 2);
				//////	НоваяСтрока.СуммаНДС	= ВыборкаЗапроса.СуммаНДС;
				//////	НоваяСтрока.Всего		= ВыборкаЗапроса.Всего;
				//////	
				//////ИначеЕсли НЕ ВыборкаЗапроса.СуммаВключаетНДС И СуммаВключаетНДС Тогда
				//////	
				//////	НоваяСтрока.Цена		= Цена;
				//////	НоваяСтрока.Сумма		= Окр(ВыборкаЗапроса.Сумма + (ВыборкаЗапроса.Сумма * ВыборкаЗапроса.Номенклатура.СтавкаНДС.Ставка / 100), 2);
				//////	НоваяСтрока.СуммаНДС	= ВыборкаЗапроса.СуммаНДС;
				//////	НоваяСтрока.Всего		= ВыборкаЗапроса.Всего;
				//////	
				//////КонецЕсли;
				
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьСписокНоменклатуры()

&НаСервере
Процедура днк_ЗаполнитьНомерДокумента(ДокументСсылка)
	
	Документ = ДокументСсылка.ПолучитьОбъект();
	Объект.Номер = Документ.Номер;
КонецПроцедуры

&НаКлиенте
Процедура днк_ЗаказПоставщикуПриИзмененииПосле(Элемент)
	
	Объект["Номер"] = "";
	Объект["Расходы"].Очистить();
	
	Если ЗначениеЗаполнено(Объект["ЗаказПоставщику"]) Тогда
		
		днк_ЗаполнитьНомерДокумента(Объект["ЗаказПоставщику"]);
		
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Объект["ЗаказПоставщику"]);
		днк_ЗаполнитьСписокНоменклатуры(МассивДокументов);
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура днк_ЗапасыДнкКоэффициентПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	ВсегоРасходы = Объект.Расходы.Итог("Всего");
	Если ВсегоРасходы <= 0 Тогда
		ТекущаяСтрока.днкКоэффициент = 0;
		Возврат;
	КонецЕсли;
	
	СуммаКоэффициентов = Объект.Запасы.Итог("днкКоэффициент");
	
	
	ТекущаяСтрока.СуммаРасходов = ТекущаяСтрока.днкКоэффициент / 100 * ВсегоРасходы;
	ИтогДнкКоэффициент = Объект.Запасы.Итог("днкКоэффициент");
	
	днк_ПроверитьИтогДнкКоэффициент();
	
КонецПроцедуры

&НаКлиенте
Процедура днк_ЗапасыСуммаРасходовПриИзмененииПосле(Элемент)
	днк_ПересчитатьДнкКоэффициентСервер();
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаКлиенте
Процедура днк_ЗапасыПослеУдаленияПосле(Элемент)
	днк_ПересчитатьДнкКоэффициентСервер();
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаКлиенте
Процедура днк_РасходыЦенаПриИзмененииПосле(Элемент)
	днк_ПересчитатьДнкКоэффициентСервер();
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаКлиенте
Процедура днк_РасходыПослеУдаленияПосле(Элемент)
	днк_ПересчитатьДнкКоэффициентСервер();
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаКлиенте
Процедура днк_ПроверитьИтогДнкКоэффициент()
	ВсегоРасходы = Объект.Расходы.Итог("Всего");
	Элементы.ЗапасыДнкКоэффициент.ЦветФонаПодвала = Новый Цвет();
	Элементы.ЗапасыДнкКоэффициент.ЦветТекстаПодвала = Новый Цвет();
	
	Если ВсегоРасходы <= 0 Тогда Возврат; КонецЕсли;
	
	СуммаКоэффициентов = Объект.Запасы.Итог("днкКоэффициент");
	
	Если СуммаКоэффициентов <> 100 Тогда 
		Элементы.ЗапасыДнкКоэффициент.ЦветФонаПодвала = Новый Цвет(178,34,34);
		Элементы.ЗапасыДнкКоэффициент.ЦветТекстаПодвала = Новый Цвет(255,182,193);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура днк_ПересчитатьДнкКоэффициентСервер()
	//Заполним проценты
	ВсегоРасходы = Объект.Расходы.Итог("Всего");
	Для Каждого строка Из Объект.Запасы Цикл
		Если ВсегоРасходы <= 0 Тогда 
			строка.днкКоэффициент = 0;
		Иначе 
			строка.днкКоэффициент = строка.СуммаРасходов / ВсегоРасходы * 100;
		КонецЕсли;
	КонецЦикла;
	//Итоги нужно считать программно :(
	ИтогДнкКоэффициент = Объект.Запасы.Итог("днкКоэффициент");
КонецПроцедуры

&НаСервере
&После("РаспределитьТабЧастьРасходыПоКоличеству")
Процедура днк_РаспределитьТабЧастьРасходыПоКоличеству()
	днк_ПересчитатьДнкКоэффициентСервер();
КонецПроцедуры

&НаСервере
&После("РаспределитьТабЧастьРасходыПоСумме")
Процедура днк_РаспределитьТабЧастьРасходыПоСумме()
	днк_ПересчитатьДнкКоэффициентСервер();
КонецПроцедуры

&НаСервере
Процедура днк_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	Если Объект.Запасы.Итог("днкКоэффициент") <> 100 Тогда
		
		ТекстСообщения = НСтр("ru='Сумма % распределения не равна 100%!';uk='Сума % розподілу не дорівнює 100%!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
		);
		
	КонецЕсли;
КонецПроцедуры
